app/Controllers/BatchController.php

SELECT `tbl_batch`.`batch_id`, `tbl_course`.`course_name`, `tbl_batch`.`batch_no`, `tbl_batch`.`batch_start_date`, `tbl_batch`.`batch_end_date`
FROM `tbl_batch`
JOIN `tbl_course` ON `tbl_course`.`course_id` = `tbl_batch`.`course_id`
---
    public function showCourseBatchdata()
    {

        $courseModel = new CourseModel();
        $batchModel = new BatchModel();


        $data['batches'] = $batchModel->select('tbl_batch.batch_id, tbl_course.course_name, tbl_batch.batch_no,
            tbl_batch.batch_start_date, tbl_batch.batch_end_date')
        ->join('tbl_course','tbl_course.course_id = tbl_batch.course_id')
        ->findAll();