app/Controllers/CourseController.php

SELECT *
FROM `tbl_course`
---
    public function showdata(){ //show the course list in table

        $courseModel = new CourseModel();

        $data['courses'] = $courseModel->findAll();