app/Controllers/DashboardController.php

SELECT count(*) AS count
FROM `tbl_student`
WHERE `student_registration_date` = '2023-07-19'
AND `tbl_student`.`deleted_at` IS NULL
 LIMIT 1
SELECT count(*) AS count
FROM `tbl_batch`
JOIN `tbl_batch_timeframe` ON `tbl_batch_timeframe`.`batch_id`  = `tbl_batch`.`batch_id`
WHERE `batch_start_date` <= '2023-07-19'
AND `batch_end_date` >= '2023-07-19'
AND `batch_day` = 'Wednesday'
 LIMIT 1
SELECT count(*) AS count
FROM `tbl_enrollment`
WHERE `en_date` = '2023-07-19'
 LIMIT 1
SELECT sum(course_payment) AS total
FROM `tbl_payment`
WHERE `payment_year_month` = '2023-07-19'
 LIMIT 1
SELECT count(*) AS count
FROM `tbl_student`
WHERE `tbl_student`.`deleted_at` IS NULL
 LIMIT 1
SELECT count(*) AS count
FROM `tbl_lecturer`
 LIMIT 1
SELECT count(*) AS count
FROM `tbl_batch`
 LIMIT 1
SELECT count(*) AS count
FROM `tbl_course`
 LIMIT 1
SELECT count(*) AS count, `assignment_grade` AS `grade`
FROM `tbl_student_marks`
GROUP BY `assignment_grade`
SELECT count(*) AS count, `tbl_course`.`course_name`
FROM `tbl_enrollment`
JOIN `tbl_course` ON `tbl_course`.`course_id`  = `tbl_enrollment`.`course_id`
GROUP BY `tbl_enrollment`.`course_id`
SELECT sum(course_payment) AS total, CONCAT(YEAR(payment_year_month), '-', MONTH(payment_year_month)) AS payment_year_month
FROM `tbl_payment`
GROUP BY YEAR(payment_year_month), MONTH(payment_year_month)
ORDER BY `payment_year_month` DESC
SELECT count(*) AS count, CONCAT(YEAR(en_date), '-', MONTH(en_date)) AS en_year_month
FROM `tbl_enrollment`
GROUP BY YEAR(en_date), MONTH(en_date)
ORDER BY `en_date` DESC
---
    public function index()

    {
        $studentModel = new StudentModel();
        $data['today_reg_student'] = $studentModel->select('count(*) AS count')  //count is mysql
        ->where('student_registration_date',date('Y-m-d'))->first();

        $batchModel = new BatchModel();
        $data['today_class'] = $batchModel->select('count(*) AS count')
        ->join('tbl_batch_timeframe','tbl_batch_timeframe.batch_id  = tbl_batch.batch_id')
        ->where('batch_start_date <=',date('Y-m-d'))->where('batch_end_date >=',date('Y-m-d'))->where('batch_day',date('l'))->first();

        $enrollmentModel = new EnrollmentModel();
        $data['today_enrollments'] = $enrollmentModel->select('count(*) AS count')  //count is mysql
        ->where('en_date',date('Y-m-d'))->first();

        $paymentModel = new PaymentModel();
        $data['today_payments'] = $paymentModel->select('sum(course_payment) AS total')  //sum of mysql
        ->where('payment_year_month',date('Y-m-d'))->first();

        $studentModel = new StudentModel();
        $data['total_students'] = $studentModel->select('count(*) AS count')->first();

        $lecturerModel = new LecturerModel();
        $data['total_lecturers'] = $lecturerModel->select('count(*) AS count')->first();

        $batchModel = new BatchModel();
        $data['total_batches'] = $batchModel->select('count(*) AS count')->first();

        $courseModel = new CourseModel();
        $data['total_courses'] = $courseModel->select('count(*) AS count')->first();

        $studentMarksModel = new StudentMarksModel();
        $data['bar_assignment_grade'] = $studentMarksModel->select('count(*) AS count, assignment_grade AS grade')->groupBy('assignment_grade')->findAll();  //y-axis && x-axis

        $enrollmentModel = new EnrollmentModel();
        $data['pie_enrollments'] = $enrollmentModel->select('count(*) AS count, tbl_course.course_name')->groupBy('tbl_enrollment.course_id')
        ->join('tbl_course','tbl_course.course_id  = tbl_enrollment.course_id')
        ->findAll();

        $paymentModel = new PaymentModel();
        $data['last_sixmonth_payments'] = $paymentModel->select("sum(course_payment) AS total, CONCAT(YEAR(payment_year_month),'-',MONTH(payment_year_month)) AS payment_year_month")->groupBy('YEAR(payment_year_month) , MONTH(payment_year_month)')->orderBy('payment_year_month','DESC')->limit(6)->findAll();

        $enrollmentModel = new EnrollmentModel();
        $data['last_sixmonth_enrollments'] = $enrollmentModel->select("count(*) AS count, CONCAT(YEAR(en_date),'-',MONTH(en_date)) AS en_year_month")->groupBy('YEAR(en_date) , MONTH(en_date)')->orderBy('en_date','DESC')->limit(6)->findAll();