app/Controllers/LecturerController.php

    public function showdata(){

        $lecturerModel = new LecturerModel();

        $data['lecturer'] = $lecturerModel->findAll();
---
SELECT *
FROM `tbl_lecturer`