app/Controllers/LecturerPortalController.php

    public function index()
    {
        //if(!userlooged){
        //     redirect(login)
        // }else if(type != admin){
        //     redirect(login)
        // }
        $enrollmentModel = new EnrollmentModel();
        $data['total_students'] = $enrollmentModel->select('count(*) AS count')
        ->join('tbl_appointment','tbl_enrollment.course_id = tbl_appointment.course_id AND tbl_enrollment.batch_id = tbl_appointment.batch_id')
        ->where('tbl_appointment.lecturer_id',session('lecturer_id'))->first();

        $batchModel = new BatchModel();
        $data['total_batches'] = $batchModel->select('count(*) AS count')
        ->join('tbl_appointment','tbl_appointment.batch_id = tbl_batch.batch_id')
        ->where('tbl_appointment.lecturer_id',session('lecturer_id'))->first();

        $appointModel = new AppointModel();
        $data['total_subjects'] = $appointModel->select('count(*) AS count')
        ->where('tbl_appointment.lecturer_id',session('lecturer_id'))->first();

        $batchModel = new BatchModel();
        $data['today_class'] = $batchModel->select('count(*) AS count')
        ->join('tbl_batch_timeframe','tbl_batch_timeframe.batch_id  = tbl_batch.batch_id')
        ->join('tbl_appointment','tbl_appointment.batch_id  = tbl_batch.batch_id')
        ->where('batch_start_date <=',date('Y-m-d'))->where('batch_end_date >=',date('Y-m-d'))->where('batch_day',date('l')) ->where('tbl_appointment.lecturer_id',session('lecturer_id'))->first();
---
SELECT count(*) AS count
FROM `tbl_enrollment`
JOIN `tbl_appointment` ON `tbl_enrollment`.`course_id` = `tbl_appointment`.`course_id` AND `tbl_enrollment`.`batch_id` = `tbl_appointment`.`batch_id`
WHERE `tbl_appointment`.`lecturer_id` = '8'
 LIMIT 1
SELECT count(*) AS count
FROM `tbl_batch`
JOIN `tbl_appointment` ON `tbl_appointment`.`batch_id` = `tbl_batch`.`batch_id`
WHERE `tbl_appointment`.`lecturer_id` = '8'
 LIMIT 1
SELECT count(*) AS count
FROM `tbl_appointment`
WHERE `tbl_appointment`.`lecturer_id` = '8'
 LIMIT 1
SELECT count(*) AS count
FROM `tbl_batch`
JOIN `tbl_batch_timeframe` ON `tbl_batch_timeframe`.`batch_id`  = `tbl_batch`.`batch_id`
JOIN `tbl_appointment` ON `tbl_appointment`.`batch_id`  = `tbl_batch`.`batch_id`
WHERE `batch_start_date` <= '2023-07-19'
AND `batch_end_date` >= '2023-07-19'
AND `batch_day` = 'Wednesday'
AND `tbl_appointment`.`lecturer_id` = '8'
 LIMIT 1