app/Controllers/LoginController.php

    public function authenticate(){

        $loginModel = new UserModel();

        $username = $this->request->getPost('user_name');
        $password = $this->request->getPost('user_password')[0];

        $user = $loginModel->where('user_name',$username)->first(); //where('tbl col name',loginform username) //first->take the first record
---
SELECT *
FROM `tbl_user`
WHERE `user_name` = 'aaa'
AND `tbl_user`.`deleted_at` IS NULL
 LIMIT 1