app/Controllers/StudentContoller.php

    public function showdata(){

        $studentModel = new StudentModel();

        $data['student'] = $studentModel->findAll();
---
SELECT *
FROM `tbl_student`