app/Controllers/SubjectController.php

    public function showdata(){

        $subjectModel = new SubjectModel();

        $data['subject'] = $subjectModel->findAll();
---
SELECT *
FROM `tbl_subject`